#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.branch-protection["my-devops-playground/static-site"].data.github_repository.repository will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository" "repository" {
      + allow_auto_merge            = (known after apply)
      + allow_merge_commit          = (known after apply)
      + allow_rebase_merge          = (known after apply)
      + allow_squash_merge          = (known after apply)
      + archived                    = (known after apply)
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + full_name                   = "my-devops-playground/static-site"
      + git_clone_url               = (known after apply)
      + has_downloads               = (known after apply)
      + has_issues                  = (known after apply)
      + has_projects                = (known after apply)
      + has_wiki                    = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = (known after apply)
      + merge_commit_title          = (known after apply)
      + name                        = (known after apply)
      + node_id                     = (known after apply)
      + pages                       = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = (known after apply)
      + squash_merge_commit_title   = (known after apply)
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
    }

  # module.branch-protection["my-devops-playground/static-site"].github_branch_protection.branch_protection will be created
  + resource "github_branch_protection" "branch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "master"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.branch-protection["my-devops-playground/static-site"].github_repository_file.codeowners_file_upload will be created
  + resource "github_repository_file" "codeowners_file_upload" {
      + branch              = "master"
      + commit_author       = "@devops"
      + commit_email        = (known after apply)
      + commit_message      = "Added CODEOWNER file for branch protection"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            
            .github/ @my-devops-playground/admins
        EOT
      + file                = ".github/CODEOWNER"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = (known after apply)
      + sha                 = (known after apply)
    }

  # module.memberships["my-devops-playground/static-site"].github_team_repository.add_repo_to_team["my-devops-playground/admins"] will be created
  + resource "github_team_repository" "add_repo_to_team" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "my-devops-playground/static-site"
      + team_id    = "my-devops-playground/admins"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mariogarcia, Action: `pull_request`*